public class HelpMenu1 {
    public void InfoMenu1(){
        System.out.println("1. help - справка по командам" +"\n" + "2. info - информация о колекции" + "\n" + "3. show - вывести все элементы коллекции" +
                "\n" + "4. insertElement - добавить новый элемент с заданным ключом"+"\n"+"5. updateById - обновить значение элемента по id"+"\n"+"6. removeByKey - удалить элемент по ключу" +
                "\n"+"7. clear - очистить коллекцию " +  "\n"+"8. script - скрипт"+"\n"+
                "9. exit - завершить программу без сохранения в файл" + "\n" + "10. removeGreater - удалить все эелементы, превышающие заданный"+"\n"+
                "11. removeLower - удалить все элементы, которые меньше заданного"+"\n"+ "12. history - вывести последние 15 команд" + "\n"+
                "13. sumOfHeight - вывести сумму значений поля high всех элементов коллекции"+"\n"+
                "14. maxByEyeColor - вывести любой объект из коллекции, значение поля eyeColor которого является максимальным"+"\n"+
                "15. filterName - вывести элементы, значение поля name которых содержит заданную подстроку");

    }


}
